using System;

namespace task03
{
    internal static class Program
    {
        private static void Main()
        {
            //Создайте коллекцию MyDictionary<TKey,TValue>.
            //Реализуйте в простейшем приближении возможность использования ее экземпляра аналогично экземпляру класса Dictionary<TKey,TValue>.
            //Минимально требуемый интерфейс взаимодействия с экземпляром, должен включать метод добавления элемента,
            //индексатор для получения значения элемента по указанному индексу и свойство только для чтения для получения общего количества элементов.
            //Реализуйте возможность перебора элементов коллекции в цикле foreach.
        }
    }
}